vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1181_DFP.pdsc
    <condition id="allOf.device=MIMXRT1181.internal_condition">
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.audio_sai_edma_adapter.condition_id">
      <require condition="allOf.driver.sai_edma, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.driver.sai_edma, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=component.rgpio_adapter, driver.rgpio, component.timer_manager, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.rgpio_adapter, driver.rgpio, component.timer_manager, device=MIMXRT1181.internal_condition">
      <require condition="anyOf.allOf=component.rgpio_adapter, driver.rgpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.rgpio_adapter, driver.rgpio.internal_condition">
      <accept condition="allOf.component.rgpio_adapter, driver.rgpio.internal_condition"/>
    </condition>
    <condition id="allOf.component.rgpio_adapter, driver.rgpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rgpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.cs42888_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.da7212_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.ele_crypto.condition_id">
      <require condition="allOf.anyOf=allOf=core=cm33, driver.cache_xcache, driver.s3mu, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=core=cm33, driver.cache_xcache, driver.s3mu, device=MIMXRT1181.internal_condition">
      <require condition="anyOf.allOf=core=cm33, driver.cache_xcache.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="s3mu"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=core=cm33, driver.cache_xcache.internal_condition">
      <accept condition="allOf.core=cm33, driver.cache_xcache.internal_condition"/>
    </condition>
    <condition id="allOf.core=cm33, driver.cache_xcache.internal_condition">
      <require condition="core.cm33.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
    </condition>
    <condition id="core.cm33.internal_condition">
      <accept Dcore="Cortex-M33"/>
    </condition>
    <condition id="component.ele_nvm_manager.condition_id">
      <require condition="allOf.component.ele_crypto, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.component.ele_crypto, device=MIMXRT1181.internal_condition">
      <require Cclass="ele_crypto" Cgroup="ele_crypto"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.eth_phy_common.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.exception_handling_cm7.condition_id">
      <require condition="allOf.utility.assert, utility.debug_console, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.utility.assert, utility.debug_console, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MIMXRT1181.internal_condition">
      <require condition="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition">
      <accept condition="allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition"/>
    </condition>
