vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1181_DFP.pdsc
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_xcache, driver.romapi, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_xcache, driver.romapi, device=MIMXRT1181.internal_condition">
      <require condition="anyOf.driver.cache_xcache, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_xcache, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_xcache"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phyaqr113c.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phyar8031.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phydp8384x.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phygpy215.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phyksz8041.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phyksz8081.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phylan8720a.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phylan8741.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8201.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8211f.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phytja1100.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phytja1120.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phyvsc8541.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.phyyt8521.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.rgpio_adapter.condition_id">
      <require condition="allOf.driver.rgpio, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rgpio, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MIMXRT1181.internal_condition">
      <require condition="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.anyOf=driver.lpuart, device=MIMXRT1181.internal_condition"/>
    </condition>
