vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1181_DFP.pdsc
    <condition id="allOf.anyOf=driver.edma4, driver.lpuart, device=MIMXRT1181.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.mecc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1181xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.memory.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.misc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.msgintr.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1181xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mu1.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1181xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.netc.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MIMXRT1181xxxxx, driver.netc_rt1180, driver.common, device_id=MIMXRT1181xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MIMXRT1181xxxxx, driver.netc_rt1180, driver.common, device_id=MIMXRT1181xxxxx.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MIMXRT1181xxxxx, driver.netc_rt1180.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MIMXRT1181xxxxx.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MIMXRT1181xxxxx, driver.netc_rt1180.internal_condition">
      <accept condition="allOf.anyOf=device_id=MIMXRT1181xxxxx, driver.netc_rt1180.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MIMXRT1181xxxxx, driver.netc_rt1180.internal_condition">
      <require condition="anyOf.device_id=MIMXRT1181xxxxx.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="netc_rt1180"/>
    </condition>
    <condition id="driver.netc_imx952.condition_id">
      <require condition="allOf.device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.netc_msg.condition_id">
      <require condition="allOf.driver.netc, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.driver.netc, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="netc"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.netc_phywrapper.condition_id">
      <require condition="allOf.driver.netc, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.netc_rt1180.condition_id">
      <require condition="allOf.anyOf=device_id=MIMXRT1181xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MIMXRT1181xxxxx.internal_condition">
      <require condition="anyOf.device_id=MIMXRT1181xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.netc_switch.condition_id">
      <require condition="allOf.driver.netc, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.pcm186x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm186x_adapter, driver.codec, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.pcm512x.condition_id">
      <require condition="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.component.codec_adapters, component.codec_i2c, component.pcm512x_adapter, driver.codec, device=MIMXRT1181.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_adapters"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="driver.pdm.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1181xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.pdm_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.pdm, device=MIMXRT1181.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.pdm, device=MIMXRT1181.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pdm"/>
      <require condition="device.MIMXRT1181.internal_condition"/>
    </condition>
