vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1181_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nb_fw" Cversion="1.0.0" condition="component.wifi_bt_module.nb_fw.condition_id">
      <description>Narrow band firmware</description>
      <RTE_Components_h>
#ifndef CONFIG_BT_IND_DNLD
#define CONFIG_BT_IND_DNLD 1
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.nb_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tx_pwr_limits" Cversion="1.0.0" condition="component.wifi_bt_module.tx_pwr_limits.condition_id">
      <description>Wi-Fi module Tx power limits</description>
      <files>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/wlan_txpwrlimit_cfg_WW_rw610.h" projectpath="component/wifi_bt_module/AzureWave/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1XK_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_1ZM_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_2EL_WW.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/Murata/tx_pwr_limits/wlan_txpwrlimit_cfg_murata_NH.h" projectpath="component/wifi_bt_module/Murata/tx_pwr_limits"/>
        <file category="header" name="components/wifi_bt_module/u-blox/tx_pwr_limits/wlan_txpwrlimit_cfg_jody_w5_WW.h" projectpath="component/wifi_bt_module/u-blox/tx_pwr_limits"/>
        <file category="include" name="components/wifi_bt_module/AzureWave/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/Murata/tx_pwr_limits/"/>
        <file category="include" name="components/wifi_bt_module/u-blox/tx_pwr_limits/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_bt_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_bt_combo_fw.condition_id">
      <description>Wi-Fi/BT combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_BT_CMOBO_DNLD
        #define CONFIG_WIFI_BT_CMOBO_DNLD
        #endif
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_bt_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_fw.condition_id">
      <description>Wi-Fi firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 1
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wifi_nb_combo_fw" Cversion="1.0.0" condition="component.wifi_bt_module.wifi_nb_combo_fw.condition_id">
      <description>wifi_nb_combo firmware</description>
      <RTE_Components_h>
        #ifndef CONFIG_WIFI_IND_DNLD
        #define CONFIG_WIFI_IND_DNLD 0
        #endif
        #ifndef CONFIG_WIFI_IND_RESET
        #define CONFIG_WIFI_IND_RESET 0
        #endif
      </RTE_Components_h>
      <files>
        <file category="doc" name="components/wifi_bt_module/component.wifi_bt_module.wifi_nb_combo_fw_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1181_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MIMXRT1181_cmsis</description>
      <files>
        <file category="header" name="devices/MIMXRT1181/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1181/MIMXRT1181.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1181/MIMXRT1181_features.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1181/MIMXRT1181_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ADC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ANADIG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ANADIG_LDO_BBSM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ANADIG_MISC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ANADIG_OSC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ANADIG_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ANADIG_PMU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ANADIG_TEMPSENSOR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_AOI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ASRC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_AXBS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_BBNSM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_BLK_CTRL_BBSMMIX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_BLK_CTRL_NS_AONMIX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_BLK_CTRL_S_AONMIX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_BLK_CTRL_WAKEUPMIX.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_CACHE_ECC_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_CAN.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_CCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_CMP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_DAC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_DCDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_DMA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_DMA4.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ECAT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_EIM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ENETC_GLOBAL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ENETC_PCI_TYPE0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ENETC_PF_EMDIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ENETC_PF_TMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ENETC_SI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ENETC_VF_PCI_TYPE0.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_EQDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_ERM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_EWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_FLEXIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_FLEXSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_FLEXSPI_SLV.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_GPC_CPU_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_GPC_GLOBAL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_GPC_SYS_SLEEP_CTRL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_GPT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_I2S.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_I3C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_IEE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_IEE_APC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_IERC_IERB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_IERC_PCI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_IOMUXC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_IOMUXC_AON.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_KPP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_LPI2C.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_LPIT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_LPSPI.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_LPTMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_LPUART.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_M7_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_MECC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_MSGINTR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_NETC_ENETC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_NETC_ETH_LINK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_NETC_IERB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_NETC_PORT.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_NETC_PRIV.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_NETC_PSEUDO_LINK.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_NETC_SW.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_NETC_SW_ENETC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_OCOTP_FSB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_OSC_RC_400M.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_OTFAD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_PDM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_PHY_LDO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_PLL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_PWM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_RGPIO.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_RTWDOG.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_S3MU.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SEMA42.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SEMC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SINC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SPDIF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SRC_GENERAL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SRC_MIF_LN28FDSOI_SPLLRAM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SRC_MIF_S28SPREGH.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SRC_MIF_S28SPREGH_PSWA.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SRC_MIX_SLICE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SYSPM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SYS_CTR_COMPARE.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SYS_CTR_CONTROL.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_SYS_CTR_READ.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_TCM_ECC_MCM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_TMPSNS.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_TMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_TPM.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_TRDC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_TSTMR.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_USB.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_USBHSDCD.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_USBNC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_USBPHY.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_USDHC.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_VMBANDGAP.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_VREF.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_XBAR_NUM_OUT221.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_XBAR_NUM_OUT32.h" projectpath="device/periph"/>
        <file category="header" name="devices/MIMXRT1181/periph/PERI_XCACHE.h" projectpath="device/periph"/>
        <file category="include" name="devices/MIMXRT1181/"/>
        <file category="include" name="devices/MIMXRT1181/periph/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1181/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1181/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xip_device" Cversion="1.0.0" condition="device.boot_header.condition_id">
      <description>Device Boot Header</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1181/xip/fsl_flexspi_nor_boot.c" projectpath="xip"/>
        <file category="header" name="devices/MIMXRT1181/xip/fsl_flexspi_nor_boot.h" projectpath="xip"/>
        <file category="include" name="devices/MIMXRT1181/xip/"/>
      </files>
    </component>
