vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1181_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="1.1.2" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_romapi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_romapi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtwdog" Cversion="2.1.4" condition="driver.rtwdog.condition_id">
      <description>RTWDOG Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_rtwdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_rtwdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="s3mu" Cversion="2.0.2" condition="driver.s3mu.condition_id">
      <description>S3MU Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_s3mu.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_s3mu.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.8" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.7.3" condition="driver.sai_edma.condition_id">
      <description>SAI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_sai_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_sai_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sema42" Cversion="2.1.1" condition="driver.sema42.condition_id">
      <description>SEMA42 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_sema42.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_sema42.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sgtl5000" Cversion="2.1.1" condition="driver.sgtl5000.condition_id">
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/sgtl5000/fsl_sgtl5000.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/sgtl5000/fsl_sgtl5000.c" projectpath="codec"/>
        <file category="include" name="components/codec/sgtl5000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif" Cversion="2.0.7" condition="driver.spdif.condition_id">
      <description>SPDIF Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_spdif.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_spdif.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spdif_edma" Cversion="2.0.8" condition="driver.spdif_edma.condition_id">
      <description>SPDIF EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_spdif_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_spdif_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="soc_src" Cversion="2.0.1" condition="driver.src_3.condition_id">
      <description>SOC SRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1181/drivers/fsl_soc_src.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1181/drivers/fsl_soc_src.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1181/drivers/"/>
      </files>
    </component>
